# 특정 값으로 초기화 된 이차원 리스트 만들기
# 1. 직접 작성
matrix1 = [[0,0,0][0,0,0][0,0,0][0,0,0]]

matrix2 = [
    [0,0,0]
    [0,0,0]
    [0,0,0]
    [0,0,0]
]

# 2. 반복문으로 작성(100*100행렬)
matrix = []

for _ in range(100):
    matrix.append([0] * 100)

# 2. 반복문으로 작성(n*m 행렬)
n = 4 # 행
m = 3 # 열
matrix = []

for _ in range(n):
    matrix.append([0] * m)

print(matrix)
#>>[[0,0,0][0,0,0][0,0,0][0,0,0]]

# 3. 리스트 컴프리헨션으로 작성(n*m 행렬)
n = 4 #행
m = 3 #열

matrix = [[0] * m for _ in range(n)]

print(matrix)
#>>[[0,0,0][0,0,0][0,0,0][0,0,0]]